TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_tdc.h
// Field:  [13:8] STOP_SRC
//
// Select stop source from the asynchronous AUX event bus.
//
// Change only while STAT.STATE is IDLE.
// ENUMs:
// NO_EVENT                 No event.
// AUX_TDC_PRE              Select TDC Prescaler event which is generated by
//                          configuration of PRECTL.
// AUX_SMPH_AUTOTAKE_DONE   AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE
// AUX_ADC_FIFO_NOT_EMPTY   AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY
// AUX_ADC_FIFO_ALMOST_FULL AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_IRQ              AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ
// AUX_ADC_DONE             AUX_EVCTL:EVSTAT3.AUX_ADC_DONE
// AUX_ISRC_RESET_N         AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N
// AUX_TDC_DONE             AUX_EVCTL:EVSTAT3.AUX_TDC_DONE
// AUX_TIMER0_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV
// AUX_TIMER1_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV
// AUX_TIMER2_PULSE         AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE
// AUX_TIMER2_EV3           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
// AUX_COMPB                AUX_EVCTL:EVSTAT2.AUX_COMPB
// AUX_COMPA                AUX_EVCTL:EVSTAT2.AUX_COMPA
// MCU_OBSMUX1              AUX_EVCTL:EVSTAT2.MCU_OBSMUX1
// MCU_OBSMUX0              AUX_EVCTL:EVSTAT2.MCU_OBSMUX0
// MCU_EV                   AUX_EVCTL:EVSTAT2.MCU_EV
// ACLK_REF                 AUX_EVCTL:EVSTAT2.ACLK_REF
// VDDR_RECHARGE            AUX_EVCTL:EVSTAT2.VDDR_RECHARGE
// MCU_ACTIVE               AUX_EVCTL:EVSTAT2.MCU_ACTIVE
// PWR_DWN                  AUX_EVCTL:EVSTAT2.PWR_DWN
// SCLK_LF                  AUX_EVCTL:EVSTAT2.SCLK_LF
// AON_BATMON_TEMP_UPD      AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD
// AON_BATMON_BAT_UPD       AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD
// AON_RTC_4KHZ             AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// AON_RTC_CH2              AUX_EVCTL:EVSTAT2.AON_RTC_CH2
// MANUAL_EV                AUX_EVCTL:EVSTAT2.MANUAL_EV
// AUXIO31                  AUX_EVCTL:EVSTAT1.AUXIO31
// AUXIO30                  AUX_EVCTL:EVSTAT1.AUXIO30
// AUXIO29                  AUX_EVCTL:EVSTAT1.AUXIO29
// AUXIO28                  AUX_EVCTL:EVSTAT1.AUXIO28
// AUXIO27                  AUX_EVCTL:EVSTAT1.AUXIO27
// AUXIO26                  AUX_EVCTL:EVSTAT1.AUXIO26
// AUXIO25                  AUX_EVCTL:EVSTAT1.AUXIO25
// AUXIO24                  AUX_EVCTL:EVSTAT1.AUXIO24
// AUXIO23                  AUX_EVCTL:EVSTAT1.AUXIO23
// AUXIO22                  AUX_EVCTL:EVSTAT1.AUXIO22
// AUXIO21                  AUX_EVCTL:EVSTAT1.AUXIO21
// AUXIO20                  AUX_EVCTL:EVSTAT1.AUXIO20
// AUXIO19                  AUX_EVCTL:EVSTAT1.AUXIO19
// AUXIO18                  AUX_EVCTL:EVSTAT1.AUXIO18
// AUXIO17                  AUX_EVCTL:EVSTAT1.AUXIO17
// AUXIO16                  AUX_EVCTL:EVSTAT1.AUXIO16
// AUXIO15                  AUX_EVCTL:EVSTAT0.AUXIO15
// AUXIO14                  AUX_EVCTL:EVSTAT0.AUXIO14
// AUXIO13                  AUX_EVCTL:EVSTAT0.AUXIO13
// AUXIO12                  AUX_EVCTL:EVSTAT0.AUXIO12
// AUXIO11                  AUX_EVCTL:EVSTAT0.AUXIO11
// AUXIO10                  AUX_EVCTL:EVSTAT0.AUXIO10
// AUXIO9                   AUX_EVCTL:EVSTAT0.AUXIO9
// AUXIO8                   AUX_EVCTL:EVSTAT0.AUXIO8
// AUXIO7                   AUX_EVCTL:EVSTAT0.AUXIO7
// AUXIO6                   AUX_EVCTL:EVSTAT0.AUXIO6
// AUXIO5                   AUX_EVCTL:EVSTAT0.AUXIO5
// AUXIO4                   AUX_EVCTL:EVSTAT0.AUXIO4
// AUXIO3                   AUX_EVCTL:EVSTAT0.AUXIO3
// AUXIO2                   AUX_EVCTL:EVSTAT0.AUXIO2
// AUXIO1                   AUX_EVCTL:EVSTAT0.AUXIO1
// AUXIO0                   AUX_EVCTL:EVSTAT0.AUXIO0
#define AUX_TDC_TRIGSRC_STOP_SRC_W                                           6
#define AUX_TDC_TRIGSRC_STOP_SRC_M                                  0x00003F00
#define AUX_TDC_TRIGSRC_STOP_SRC_S                                           8
#define AUX_TDC_TRIGSRC_STOP_SRC_NO_EVENT                           0x00003F00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TDC_PRE                        0x00003E00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_SMPH_AUTOTAKE_DONE             0x00003D00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_ADC_FIFO_NOT_EMPTY             0x00003C00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_ADC_FIFO_ALMOST_FULL           0x00003B00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_ADC_IRQ                        0x00003A00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_ADC_DONE                       0x00003900
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_ISRC_RESET_N                   0x00003800
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TDC_DONE                       0x00003700
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TIMER0_EV                      0x00003600
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TIMER1_EV                      0x00003500
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TIMER2_PULSE                   0x00003400
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TIMER2_EV3                     0x00003300
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TIMER2_EV2                     0x00003200
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TIMER2_EV1                     0x00003100
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_TIMER2_EV0                     0x00003000
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_COMPB                          0x00002F00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUX_COMPA                          0x00002E00
#define AUX_TDC_TRIGSRC_STOP_SRC_MCU_OBSMUX1                        0x00002D00
#define AUX_TDC_TRIGSRC_STOP_SRC_MCU_OBSMUX0                        0x00002C00
#define AUX_TDC_TRIGSRC_STOP_SRC_MCU_EV                             0x00002B00
#define AUX_TDC_TRIGSRC_STOP_SRC_ACLK_REF                           0x00002A00
#define AUX_TDC_TRIGSRC_STOP_SRC_VDDR_RECHARGE                      0x00002900
#define AUX_TDC_TRIGSRC_STOP_SRC_MCU_ACTIVE                         0x00002800
#define AUX_TDC_TRIGSRC_STOP_SRC_PWR_DWN                            0x00002700
#define AUX_TDC_TRIGSRC_STOP_SRC_SCLK_LF                            0x00002600
#define AUX_TDC_TRIGSRC_STOP_SRC_AON_BATMON_TEMP_UPD                0x00002500
#define AUX_TDC_TRIGSRC_STOP_SRC_AON_BATMON_BAT_UPD                 0x00002400
#define AUX_TDC_TRIGSRC_STOP_SRC_AON_RTC_4KHZ                       0x00002300
#define AUX_TDC_TRIGSRC_STOP_SRC_AON_RTC_CH2_DLY                    0x00002200
#define AUX_TDC_TRIGSRC_STOP_SRC_AON_RTC_CH2                        0x00002100
#define AUX_TDC_TRIGSRC_STOP_SRC_MANUAL_EV                          0x00002000
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO31                            0x00001F00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO30                            0x00001E00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO29                            0x00001D00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO28                            0x00001C00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO27                            0x00001B00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO26                            0x00001A00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO25                            0x00001900
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO24                            0x00001800
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO23                            0x00001700
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO22                            0x00001600
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO21                            0x00001500
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO20                            0x00001400
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO19                            0x00001300
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO18                            0x00001200
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO17                            0x00001100
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO16                            0x00001000
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO15                            0x00000F00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO14                            0x00000E00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO13                            0x00000D00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO12                            0x00000C00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO11                            0x00000B00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO10                            0x00000A00
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO9                             0x00000900
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO8                             0x00000800
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO7                             0x00000700
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO6                             0x00000600
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO5                             0x00000500
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO4                             0x00000400
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO3                             0x00000300
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO2                             0x00000200
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO1                             0x00000100
#define AUX_TDC_TRIGSRC_STOP_SRC_AUXIO0                             0x00000000

// Field:     [6] START_POL
//
// Polarity of start source.
//
// Change only while STAT.STATE is IDLE.
// ENUMs:
// LOW                      TDC conversion starts when low level is detected.
// HIGH                     TDC conversion starts when high level is detected.
#define AUX_TDC_TRIGSRC_START_POL                                   0x00000040
#define AUX_TDC_TRIGSRC_START_POL_BITN                                       6
#define AUX_TDC_TRIGSRC_START_POL_M                                 0x00000040
#define AUX_TDC_TRIGSRC_START_POL_S                                          6
#define AUX_TDC_TRIGSRC_START_POL_LOW                               0x00000040
#define AUX_TDC_TRIGSRC_START_POL_HIGH                              0x00000000

// Field:   [5:0] START_SRC
//
// Select start source from the asynchronous AUX event bus.
//
// Change only while STAT.STATE is IDLE.
// ENUMs:
// NO_EVENT                 No event.
// AUX_TDC_PRE              Select TDC Prescaler event which is generated by
//                          configuration of PRECTL.
// AUX_SMPH_AUTOTAKE_DONE   AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE
// AUX_ADC_FIFO_NOT_EMPTY   AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY
// AUX_ADC_FIFO_ALMOST_FULL AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_IRQ              AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ
// AUX_ADC_DONE             AUX_EVCTL:EVSTAT3.AUX_ADC_DONE
// AUX_ISRC_RESET_N         AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N
// AUX_TDC_DONE             AUX_EVCTL:EVSTAT3.AUX_TDC_DONE
// AUX_TIMER0_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV
// AUX_TIMER1_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV
// AUX_TIMER2_PULSE         AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE
// AUX_TIMER2_EV3           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
// AUX_COMPB                AUX_EVCTL:EVSTAT2.AUX_COMPB
// AUX_COMPA                AUX_EVCTL:EVSTAT2.AUX_COMPA
// MCU_OBSMUX1              AUX_EVCTL:EVSTAT2.MCU_OBSMUX1
// MCU_OBSMUX0              AUX_EVCTL:EVSTAT2.MCU_OBSMUX0
// MCU_EV                   AUX_EVCTL:EVSTAT2.MCU_EV
// ACLK_REF                 AUX_EVCTL:EVSTAT2.ACLK_REF
// VDDR_RECHARGE            AUX_EVCTL:EVSTAT2.VDDR_RECHARGE
// MCU_ACTIVE               AUX_EVCTL:EVSTAT2.MCU_ACTIVE
// PWR_DWN                  AUX_EVCTL:EVSTAT2.PWR_DWN
// SCLK_LF                  AUX_EVCTL:EVSTAT2.SCLK_LF
// AON_BATMON_TEMP_UPD      AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD
// AON_BATMON_BAT_UPD       AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD
// AON_RTC_4KHZ             AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// AON_RTC_CH2              AUX_EVCTL:EVSTAT2.AON_RTC_CH2
// MANUAL_EV                AUX_EVCTL:EVSTAT2.MANUAL_EV
// AUXIO31                  AUX_EVCTL:EVSTAT1.AUXIO31
// AUXIO30                  AUX_EVCTL:EVSTAT1.AUXIO30
// AUXIO29                  AUX_EVCTL:EVSTAT1.AUXIO29
// AUXIO28                  AUX_EVCTL:EVSTAT1.AUXIO28
// AUXIO27                  AUX_EVCTL:EVSTAT1.AUXIO27
// AUXIO26                  AUX_EVCTL:EVSTAT1.AUXIO26
// AUXIO25                  AUX_EVCTL:EVSTAT1.AUXIO25
// AUXIO24                  AUX_EVCTL:EVSTAT1.AUXIO24
// AUXIO23                  AUX_EVCTL:EVSTAT1.AUXIO23
// AUXIO22                  AUX_EVCTL:EVSTAT1.AUXIO22
// AUXIO21                  AUX_EVCTL:EVSTAT1.AUXIO21
// AUXIO20                  AUX_EVCTL:EVSTAT1.AUXIO20
// AUXIO19                  AUX_EVCTL:EVSTAT1.AUXIO19
// AUXIO18                  AUX_EVCTL:EVSTAT1.AUXIO18
// AUXIO17                  AUX_EVCTL:EVSTAT1.AUXIO17
// AUXIO16                  AUX_EVCTL:EVSTAT1.AUXIO16
// AUXIO15                  AUX_EVCTL:EVSTAT0.AUXIO15
// AUXIO14                  AUX_EVCTL:EVSTAT0.AUXIO14
// AUXIO13                  AUX_EVCTL:EVSTAT0.AUXIO13
// AUXIO12                  AUX_EVCTL:EVSTAT0.AUXIO12
// AUXIO11                  AUX_EVCTL:EVSTAT0.AUXIO11
// AUXIO10                  AUX_EVCTL:EVSTAT0.AUXIO10
// AUXIO9                   AUX_EVCTL:EVSTAT0.AUXIO9
// AUXIO8                   AUX_EVCTL:EVSTAT0.AUXIO8
// AUXIO7                   AUX_EVCTL:EVSTAT0.AUXIO7
// AUXIO6                   AUX_EVCTL:EVSTAT0.AUXIO6
// AUXIO5                   AUX_EVCTL:EVSTAT0.AUXIO5
// AUXIO4                   AUX_EVCTL:EVSTAT0.AUXIO4
// AUXIO3                   AUX_EVCTL:EVSTAT0.AUXIO3
// AUXIO2                   AUX_EVCTL:EVSTAT0.AUXIO2
// AUXIO1                   AUX_EVCTL:EVSTAT0.AUXIO1
// AUXIO0                   AUX_EVCTL:EVSTAT0.AUXIO0
#define AUX_TDC_TRIGSRC_START_SRC_W                                          6
#define AUX_TDC_TRIGSRC_START_SRC_M                                 0x0000003F
#define AUX_TDC_TRIGSRC_START_SRC_S                                          0
#define AUX_TDC_TRIGSRC_START_SRC_NO_EVENT                          0x0000003F
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TDC_PRE                       0x0000003E
#define AUX_TDC_TRIGSRC_START_SRC_AUX_SMPH_AUTOTAKE_DONE            0x0000003D
#define AUX_TDC_TRIGSRC_START_SRC_AUX_ADC_FIFO_NOT_EMPTY            0x0000003C
#define AUX_TDC_TRIGSRC_START_SRC_AUX_ADC_FIFO_ALMOST_FULL          0x0000003B
#define AUX_TDC_TRIGSRC_START_SRC_AUX_ADC_IRQ                       0x0000003A
#define AUX_TDC_TRIGSRC_START_SRC_AUX_ADC_DONE                      0x00000039
#define AUX_TDC_TRIGSRC_START_SRC_AUX_ISRC_RESET_N                  0x00000038
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TDC_DONE                      0x00000037
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TIMER0_EV                     0x00000036
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TIMER1_EV                     0x00000035
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TIMER2_PULSE                  0x00000034
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TIMER2_EV3                    0x00000033
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TIMER2_EV2                    0x00000032
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TIMER2_EV1                    0x00000031
#define AUX_TDC_TRIGSRC_START_SRC_AUX_TIMER2_EV0                    0x00000030
#define AUX_TDC_TRIGSRC_START_SRC_AUX_COMPB                         0x0000002F
#define AUX_TDC_TRIGSRC_START_SRC_AUX_COMPA                         0x0000002E
#define AUX_TDC_TRIGSRC_START_SRC_MCU_OBSMUX1                       0x0000002D
#define AUX_TDC_TRIGSRC_START_SRC_MCU_OBSMUX0                       0x0000002C
#define AUX_TDC_TRIGSRC_START_SRC_MCU_EV                            0x0000002B
#define AUX_TDC_TRIGSRC_START_SRC_ACLK_REF                          0x0000002A
#define AUX_TDC_TRIGSRC_START_SRC_VDDR_RECHARGE                     0x00000029
#define AUX_TDC_TRIGSRC_START_SRC_MCU_ACTIVE                        0x00000028
#define AUX_TDC_TRIGSRC_START_SRC_PWR_DWN                           0x00000027
#define AUX_TDC_TRIGSRC_START_SRC_SCLK_LF                           0x00000026
#define AUX_TDC_TRIGSRC_START_SRC_AON_BATMON_TEMP_UPD               0x00000025
#define AUX_TDC_TRIGSRC_START_SRC_AON_BATMON_BAT_UPD                0x00000024
#define AUX_TDC_TRIGSRC_START_SRC_AON_RTC_4KHZ                      0x00000023
#define AUX_TDC_TRIGSRC_START_SRC_AON_RTC_CH2_DLY                   0x00000022
#define AUX_TDC_TRIGSRC_START_SRC_AON_RTC_CH2                       0x00000021
#define AUX_TDC_TRIGSRC_START_SRC_MANUAL_EV                         0x00000020
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO31                           0x0000001F
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO30                           0x0000001E
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO29                           0x0000001D
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO28                           0x0000001C
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO27                           0x0000001B
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO26                           0x0000001A
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO25                           0x00000019
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO24                           0x00000018
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO23                           0x00000017
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO22                           0x00000016
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO21                           0x00000015
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO20                           0x00000014
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO19                           0x00000013
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO18                           0x00000012
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO17                           0x00000011
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO16                           0x00000010
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO15                           0x0000000F
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO14                           0x0000000E
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO13                           0x0000000D
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO12                           0x0000000C
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO11                           0x0000000B
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO10                           0x0000000A
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO9                            0x00000009
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO8                            0x00000008
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO7                            0x00000007
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO6                            0x00000006
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO5                            0x00000005
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO4                            0x00000004
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO3                            0x00000003
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO2                            0x00000002
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO1                            0x00000001
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO0                            0x00000000

//*****************************************************************************
//
// Register: AUX_TDC_O_TRIGCNT
//
//*****************************************************************************
// Field:  [15:0] CNT
//
// Number of stop events to ignore when AUX_TDC:TRIGCNTCFG.EN is 1.
//
// Read CNT to get the remaining number of stop events to ignore during a TDC
// measurement.
//
// Write CNT to update the remaining number of stop events to ignore during a
// TDC measurement. The TDC measurement ignores updates of CNT if there are no
// more stop events left to ignore.
//
// When AUX_TDC:TRIGCNTCFG.EN is 1, TRIGCNTLOAD.CNT is loaded into CNT at the
// start of the measurement.
#define AUX_TDC_TRIGCNT_CNT_W                                               16
#define AUX_TDC_TRIGCNT_CNT_M                                       0x0000FFFF
#define AUX_TDC_TRIGCNT_CNT_S                                                0

//*****************************************************************************
//
// Register: AUX_TDC_O_TRIGCNTLOAD
//
//*****************************************************************************
// Field:  [15:0] CNT
//
// Number of stop events to ignore when AUX_TDC:TRIGCNTCFG.EN is 1.
//
// To measure frequency of an event source:
// - Set start event equal to stop event.
// - Set CNT to number of periods to measure. Both 0 and 1 values measures a
// single event source period.
//
// To measure pulse width of an event source:
// - Set start event source equal to stop event source.
// - Select different polarity for start and stop event.
// - Set CNT to 0.
//
// To measure time from the start event to the Nth stop event when N > 1:
// - Select different start and stop event source.
// - Set CNT to (N-1).
//
// See the Technical Reference Manual for event timing requirements.
//
// When AUX_TDC:TRIGCNTCFG.EN is 1, CNT is loaded into TRIGCNT.CNT at the start
// of the measurement.
#define AUX_TDC_TRIGCNTLOAD_CNT_W                                           16
#define AUX_TDC_TRIGCNTLOAD_CNT_M                                   0x0000FFFF
#define AUX_TDC_TRIGCNTLOAD_CNT_S                                            0

//*****************************************************************************
//
// Register: AUX_TDC_O_TRIGCNTCFG
//
//*****************************************************************************
// Field:     [0] EN
//
// Enable stop-counter.
//
// 0: Disable stop-counter.
// 1: Enable stop-counter.
//
// Change only while STAT.STATE is IDLE.
#define AUX_TDC_TRIGCNTCFG_EN                                       0x00000001
#define AUX_TDC_TRIGCNTCFG_EN_BITN                                           0
#define AUX_TDC_TRIGCNTCFG_EN_M                                     0x00000001
#define AUX_TDC_TRIGCNTCFG_EN_S                                              0

//*****************************************************************************
//
// Register: AUX_TDC_O_PRECTL
//
//*****************************************************************************
// Field:     [7] RESET_N
//
// Prescaler reset.
//
// 0: Reset prescaler.
// 1: Release reset of prescaler.
//
// AUX_TDC_PRE event becomes 0 when you reset the prescaler.
#define AUX_TDC_PRECTL_RESET_N                                      0x00000080
#define AUX_TDC_PRECTL_RESET_N_BITN                                          7
#define AUX_TDC_PRECTL_RESET_N_M                                    0x00000080
#define AUX_TDC_PRECTL_RESET_N_S                                             7

